print("\n\nЭто будет проект по задачам Эйлера!\n\n")

# -----------------------------------------------
# ---------------------Задача №1------------------
# -----------------------------------------------

print('''Первая задача!
\"Числа, кратные 3 или 6, в пределах 1 000\":''', end=" ")

sum = 0

for i in range(1000):
    if (i % 3 == 0) or (i % 5 == 0):
        sum += i

print("Ответ \"" + str(sum) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №2------------------
# -----------------------------------------------

print('''Вторая задача!
\"Чётные числа Фибоначчи, в пределах 4 000 000\":''', end = " ")

fibonach = [1, 2]   #Первые два члена последовательности Фибоначи
i = 1               #Позиция последнего текущего элемента
sum = 0             #Сумма всех чётных элементов

while fibonach[i] < 4000000:
    if fibonach[i] % 2 == 0:
        sum += fibonach[i]
    fibonach += [fibonach[i] + fibonach[i-1]]
    i += 1
print("Ответ \"" + str(sum) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №3------------------
# -----------------------------------------------
'''
number = 600851475143
test_number = 13195     # Его делители должны быть 5, 7, 13 и 29

print('Третья задача!'
print('\"Наибольший простой делитель чила ' + str(number) + '\":', end = " ")

def Zadch3(number):


    for i in range (int(number / 2), 1, -1):       #Простые числа 
        for j in range (3, i + 1, 2):                   #На которые может делиться
            if i % j != 0:                              #Наше основное число.
                continue                                #Поэтому (number + 1) / 2
            elif i == j:
                if number % i == 0:
                    print(i)
                    return
                break
            else:
                break     


Zadch3(number)
'''

# ------------------------------------------------
# ---------------------Задача №4------------------
# -----------------------------------------------

def Task4():
    palindrome = list()
    for i in range (999, 0, -1):
        for j in range (i, 0, -1):
            test = 0
            for k in range(0, int (len (str (i * j)) / 2), 1):
                if str(i * j)[k] == str(i * j)[len(str(i * j)) - 1 - k]:
                    test += 1
                if test == int (len (str (i * j)) / 2):
                    palindrome += [i * j]
    print(max(palindrome))
    
                    

Task4()