print("\n\nЭто будет проект по задачам Эйлера!\n\n")

# -----------------------------------------------
# ---------------------Задача №1------------------
# -----------------------------------------------

print("Первая задача!")
print("\"Числа, кратные 3 или 5, в пределах 1 000\":", end=" ")

summa = 0

for i in range(1000):
    if (i % 3 == 0) or (i % 5 == 0):
        summa += i

print("Ответ \"" + str(summa) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №2------------------
# -----------------------------------------------

print("Вторая задача!")
print("\"Чётные числа Фибоначчи, в пределах 4 000 000\":", end = " ")

fibonach = [1, 2]   #Первые два члена последовательности Фибоначи
i = 1               #Позиция последнего текущего элемента
summa = 0             #Сумма всех чётных элементов

while fibonach[i] < 4000000:
    if fibonach[i] % 2 == 0:
        summa += fibonach[i]
    fibonach += [fibonach[i] + fibonach[i-1]]
    i += 1
    
print("Ответ \"" + str(summa) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №3------------------
# -----------------------------------------------

'''
number = 600851475143
test_number = 13195     # Его делители должны быть 5, 7, 13 и 29

print('Третья задача!'
print('\"Наибольший простой делитель чила ' + str(number) + '\":', end = " ")

def Zadch3(number):


    for i in range (int(number / 2), 1, -1):       #Простые числа 
        for j in range (3, i + 1, 2):                   #На которые может делиться
            if i % j != 0:                              #Наше основное число.
                continue                                #Поэтому (number + 1) / 2
            elif i == j:
                if number % i == 0:
                    print(i)
                    return
                break
            else:
                break     

Zadch3(number)
'''

# ------------------------------------------------
# ---------------------Задача №4------------------
# -----------------------------------------------

print ("Четвёртая задача!")
print("\"Наибольшее произведение-палиндром\":", end = " ")

def Task4():   
    '''Наибольшее произведение-палиндром среди трёхзначных чисел'''

    palindrome = list()
    
    for i in range (999, 99, -1):
        for j in range (i, 99, -1):
            if str(i * j)[::1] == str(i * j)[::-1]:
                    palindrome += [i * j]
                    
                    
    print("Ответ \"" + str(max(palindrome)) + "\" является верным" + "\n")
    
Task4()

# ------------------------------------------------
# ---------------------Задача №5------------------
# -----------------------------------------------

print ("Пятая задача!")
print("\"Наименьшее кратное\":", end = " ")

# 2520 - самое маленькое число, которое делится без остатка на все числа от 1 до 10.
# Какое самое маленькое число делится нацело на все числа от 1 до 20?

# Думает 2 минуты 4 секунды

def Task5(number):
    ''' Какое самое маленькое число делится нацело на все числа от 1 до 20? '''
    
    list_of = list()
    
    for i in range(number, int(number / 2), -1):
        list_of.append(i)

    koll = 0

    while koll < len(list_of):
        koll = 0
        number += 1
        for i in list_of:
            if number % i == 0:
                koll += 1
            else:
                break
        
    print(number)

number = 20
Task5(number)

 # from math import abs

def Task6(num):
    
    summ = 0
    sum_kvad = 0
    
    for i in range (1, num + 1):
        summ += i
        sum_kvad += i**2
        
    print(-(sum_kvad - summ**2))

num = 100
Task6(num)