print("\n\nЭто будет проект по задачам Эйлера!\n\n")

# -----------------------------------------------
# ---------------------Задача №1------------------
# -----------------------------------------------

print('''Первая задача!
\"Числа, кратные 3 или 6, в пределах 1 000\":''', end=" ")

sum = 0

for i in range(1000):
    if (i % 3 == 0) or (i % 5 == 0):
        sum += i

print("Ответ \"" + str(sum) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №2------------------
# -----------------------------------------------

print('''Вторая задача!
\"Чётные числа Фибоначи, в пределах 4 000 000\":''', end = " ")

fibonach = [1, 2]   #Первые два члена последовательности Фибоначи
i = 1               #Позиция последнего текущего элемента
sum = 0             #Сумма всех чётных элементов

while fibonach[i] < 4000000:
    if fibonach[i] % 2 == 0:
        sum += fibonach[i]
    fibonach += [fibonach[i] + fibonach[i-1]]
    i += 1
print("Ответ \"" + str(sum) + "\" является верным" + "\n")

# ------------------------------------------------
# ---------------------Задача №3------------------
# -----------------------------------------------

number = 600851475143
test_number = 13195     # Его делители должны быть 5, 7, 13 и 29

print('''Третья задача!
\"Наибольший простой делитель чила ''' + str(number) + "\":", end = " ")

def Zadch3(number):

    prime_numbers = [2]
    i = 0

    for i in range (3, int((number + 1) / 2), 2):     #Простые числа
        for j in range (3, i + 1, 2):
            if i % j != 0:
                continue
            elif i == j:
                prime_numbers += [i]
                break
            else:
                break
    
    print(prime_numbers)            


Zadch3(test_number)